
INSERT INTO Albums(name, date) 
VALUES('Баста  3', 2010),
('Полигамность', 2018),
('Music to be murdered', 2022),
('The Metallica Blacklist', 2021),
('Здравcтсвуй, это я', 2000),
('Thunderstorm EP', 2020),
('50 cent: The Untold Story', 2019),
('WE ARE CHAOS', 2020),
('Nobody is Not Loved', 2021),
('Ecosystem', 2021);

INSERT INTO Tracks(name, time, album_id) 
VALUES('Урбан', '00:04:12', 1),
('Деньги', '00:03:19', 1),
('Олимпиада 80', '00:05:09', 1),
('Ростов', '00:04:33', 1),
('Урбан', '00:04:12', 1),
('Кинолента', '00:04:23', 1),
('Ходим по краю', '00:03:27', 1),
('Детка', '00:03:40', 1),
('Свобода', '00:03:44', 1),
('Россия', '00:04:10', 1),
('Театр', '00:05:21', 1),
('Обернись', '00:04:00', 1),
('Хэндз ап!', '00:04:03', 1),
('Отпускаю', '00:03:54', 1),
('8800', '00:02:25', 1),
('Один', '00:05:06', 1),
('Детка', '00:03:40', 1),
('Космонавт', '00:03:01', 2),
('Штампы', '00:03:08', 2),
('Дура', '00:03:49', 2),
('Полигамность', '00:02:53', 2),
('Алло', '00:02:53', 2),
('Чистое', '00:04:8', 2),
('На двоих', '00:03:37', 2),
('Alfred', '00:00:17', 3),
('Black Magic', '00:02:54', 3),
('Alfreds Theme', '00:05:39', 3),
('Tone Deaf', '00:04:50', 3),
('Book of Rhymes', '00:04:49', 3),
('Favorite Bitch', '00:03:56', 3),
('Guns Blazing', '00:03:16', 3),
('Gnat', '00:03:44', 3),
('The Warning', '00:04:22', 4),
('Mac DeMarco', '00:05:46', 4),
('Ghost', '00:03:51', 4),
('Juanes', '00:04:53', 4),
('Weezer', '00:05:34', 4),
('Royal blood', '00:05:28', 4),
('White Reaper', '00:05:22', 4),
('YB', '00:04:03', 4),
('Ай-яй-яй', '00:03:48', 5),
('Он не любит тебя', '00:04:14', 5),
('Киска любовь', '00:03:52', 5),
('Прости', '00:04:07', 5),
('I like', '00:05:29', 5),
('Не зови меня красивою', '00:05:15', 5),
('Парень', '00:03:55', 5),
('Баю-бай', '00:04:29', 5),
('Так тебе и надо', '00:03:47', 5),
('Песенка №3', '00:04:23', 5),
('Здравствуй, это я', '00:03:44', 5),
('Алёшка', '00:03:23', 5),
('Thunderstorm', '00:07:34', 6),
('The Awakening', '00:08:38', 6),
('Nothing Seems To Be', '00:09:18', 6),
('Titelbild', '00:07:42', 6),
('Keep your Eyes on yours', '00:04:05', 7),
('No, No!', '00:03:54', 7),
('Back 4 That', '00:03:34', 7),
('Gangsta Style', '00:03:42', 7),
('Its a Hit', '00:03:44', 7),
('My Baby', '00:03:16', 7),
('Bump Dat', '00:02:50', 7),
('No One on One', '00:03:04', 7),
('RED BLACK AND BLUE', '00:05:03', 8),
('WE ARE CHAOS', '00:04:00', 8),
('DONT CHASE THE DEAD', '00:04:17', 8),
('PAINT YOU WITH MY LIFE', '00:04:29', 8),
('HALF-WAY & ONE STEP FORWARD', '00:03:16', 8),
('INFINITE DARKNESS', '00:04:15', 8),
('PAINT YOU WITH MY LIFE', '00:04:29', 8),
('PERFUME', '00:03:33', 8),
('KEEP MY HEAD TOGETHER', '00:03:49', 8),
('SOLVE COAGULA', '00:04:22', 8),
('BROKEN NEEDLE', '00:05:23', 8),
('Ocean', '00:03:37', 9),
('Home', '00:03:41', 9),
('Your Loves Gives Me Gravity', '00:04:39', 9),
('The Center Will Not Hold', '00:03:50', 9),
('Out of Focus', '00:03:55', 9),
('Tuk Tuk', '00:04:13', 9),
('Never Sleep Again', '00:03:18', 9),
('Take Control', '00:04:00', 9),
('Kreatur der Nacht', '00:04:55', 9),
('Wadim', '00:04:47', 9),
('Prospect', '00:04:27', 9),
('Night Travel', '00:04:43', 9),
('Экосистема', '00:02:53', 10),
('Ecosystem', '00:03:14', 10),
('Ewigkeit', '00:02:14', 10),
('What about Ecosystem?', '00:02:25', 10);


INSERT INTO Artists(name) 
VALUES('Баста'),
('МакSим'),
('Metallica'),
('Marilyn Manson'),
('Solomun'),
('Мумий Тролль'),
('Boris Brejcha'),
('50 cent'),
('Eminem'),
('Руки вверх');

INSERT INTO genres (name) 
VALUES('Русский РЭП'),
('Industrial'),
('Trash Metall'),
('ПОП'),
('Hip-Hop'),
('House'),
('Techno'),
('Русский Рок');

INSERT INTO Collection (name) 
VALUES('The best'),
('Разное'),
('Танцы'),
('Rock is not dead'),
('Российская эстрада'),
('Сборная Рэпа');

UPDATE Collection
SET date = '17.12.2022'
WHERE id IN (1,2);

UPDATE Collection
SET date = '08.10.2017'
WHERE id IN (3,4);

UPDATE Collection
SET date = '6.06.2019'
WHERE id IN (5,6);

INSERT INTO CollectionTracks (collection_id, track_id) 
VALUES(1,2),(1,12),(1,17),(1,21),(1,20),(1,41),(1,51),(1,52),(1,56),(1,53),(1,60),(1,62),(1,68),(1,72),
(2,14),(2,47),(2,85),(2,39),(2,7),(2,15),(2,89),(2,90),
(3,76),(3,77),(3,78),(3,79),(3,80),(3,81),(3,82),(3,54),(3,55),(3,56),(3,57),
(4,65),(4,67),(4,69),(4,71),(4,73),(4,87),(4,89),(4,91),(4,34),(4,36),(4,38),
(5,2),(5,4),(5,8),(5,21),(5,23),(5,47),(5,48),
(6,10),(6,13),(6,28),(6,30),(6,32),(6,60),(6,63),(6,62);

INSERT INTO Albumsartists (album_id, artists_id) 
VALUES (1,1),(2,2),(4,3),(3,9),(5,10),(6,7),(7,8),(8,4),(9,5),(10,6);

INSERT INTO artistsgenres (artist_id, genre_id) 
VALUES (1,1), (1,5),(2,4),(3,3),(4,2),(5,6),(6,8),(7,7),(8,5),(9,5),(10,4);
